Тестовая_база_ERP_14/src/InformationRegisters/АГ_ОбъектыУпрощенногоЗапускаИнтеграцииС1СДокументооборот/АГ_ОбъектыУпрощенногоЗапускаИнтеграцииС1СДокументооборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АГ_ОбъектыУпрощенногоЗапускаИнтеграцииС1СДокументооборот</name>
  <resources>
    <name>ЗначениеОбъекта</name>
    <type>
      <types>AnyRef</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РеквизитОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/АГ_ОбъектыУпрощенногоЗапускаИнтеграцииС1СДокументооборот/Forms/ФормаЗаписи/Module.bsl
&НаСервереБезКонтекста
Функция ВидОбъектаНачалоВыбораНаСервере()
	
	//ТаблСправочников = Новый ТаблицаЗначений;
	//ТаблСправочников.Колонки.Добавить("Наименование");
	ТаблДокументов = Новый ТаблицаЗначений;
	ТаблДокументов.Колонки.Добавить("Наименование");
	
	ПолеСпискаМетаданных = Новый Массив;
	//ПолеСпискаМетаданных.Добавить("*******СПРАВОЧНИКИ:*******");
	//Для Каждого ТекСтр из Метаданные.Справочники Цикл
	//	НовСтр = ТаблСправочников.Добавить();
	//	НовСтр.Наименование = ТекСтр.Имя;
	//КонецЦикла;
	//ТаблСправочников.Сортировать("Наименование Возр");
	//Для Каждого ТекСтр из ТаблСправочников Цикл
	//	ПолеСпискаМетаданных.Добавить(СокрЛП(ТекСтр.Наименование));
	//КонецЦикла;
	
	ПолеСпискаМетаданных.Добавить("*******ДОКУМЕНТЫ:*******");
	Для Каждого ТекСтр из Метаданные.Документы Цикл
		НовСтр = ТаблДокументов.Добавить();
		НовСтр.Наименование = ТекСтр.Имя;
	КонецЦикла;
	ТаблДокументов.Сортировать("Наименование Возр");
	Для Каждого ТекСтр из ТаблДокументов Цикл
		ПолеСпискаМетаданных.Добавить(СокрЛП(ТекСтр.Наименование));
	КонецЦикла;
	
	Возврат ПолеСпискаМетаданных;	
	
	
КонецФункции

&НаКлиенте
Процедура ВидОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокЗн = ВидОбъектаНачалоВыбораНаСервере();
	Элементы.ВидОбъекта.СписокВыбора.ЗагрузитьЗначения(СписокЗн);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = "*******СПРАВОЧНИКИ:*******" Или ВыбранноеЗначение = "*******ДОКУМЕНТЫ:*******" Тогда
		СтандартнаяОбработка = Ложь;
		Запись.ТипОбъекта = "";
		Запись.ВидОбъекта = "";
		Возврат;
	Иначе
		Запись.ТипОбъекта = "Документ";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Документы
	ТаблДокументов = Новый ТаблицаЗначений;
	ТаблДокументов.Колонки.Добавить("Наименование");
	
	МассивЗн = Новый Массив;
	Для Каждого ТекСтр из Метаданные.Документы Цикл
		НовСтр = ТаблДокументов.Добавить();
		НовСтр.Наименование = ТекСтр.Имя;
	КонецЦикла;
	ТаблДокументов.Сортировать("Наименование Возр");
	Для Каждого ТекСтр из ТаблДокументов Цикл
		МассивЗн.Добавить(СокрЛП(ТекСтр.Наименование));
	КонецЦикла;
	
	Элементы.ВидОбъекта.СписокВыбора.ЗагрузитьЗначения(МассивЗн);
	
	//Реквизиты документов
	ТаблРеквизитов = Новый ТаблицаЗначений;
	ТаблРеквизитов.Колонки.Добавить("Наименование");
	
	МассивЗн = Новый Массив;
	
	Если Метаданные.Документы.Найти(Запись.ВидОбъекта) <> Неопределено Тогда
		Для Каждого ТекСтр из Метаданные.Документы[Запись.ВидОбъекта].Реквизиты Цикл
			НовСтр = ТаблРеквизитов.Добавить();
			НовСтр.Наименование = ТекСтр.Имя;
		КонецЦикла;
	КонецЕсли;
	ТаблРеквизитов.Сортировать("Наименование Возр");
	Для Каждого ТекСтр из ТаблРеквизитов Цикл
		МассивЗн.Добавить(СокрЛП(ТекСтр.Наименование));
	КонецЦикла;
	
	Элементы.РеквизитОбъекта.СписокВыбора.ЗагрузитьЗначения(МассивЗн);
	
	Попытка
		Если ЗначениеЗаполнено(Запись.ВидОбъекта) И ЗначениеЗаполнено(Запись.РеквизитОбъекта) Тогда
			Для Каждого ТекСтр из Метаданные.Документы[Запись.ВидОбъекта].Реквизиты[Запись.РеквизитОбъекта].Тип.Типы() Цикл
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТекСтр);
				Элементы.ЗначениеОбъекта.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
				Прервать;
			КонецЦикла;
		КонецЕсли;
	Исключение
	КонецПопытки;

КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитНачалоВыбораНаСервере(ВидОбъекта)
	
	ТаблРеквизитов = Новый ТаблицаЗначений;
	ТаблРеквизитов.Колонки.Добавить("Наименование");
	
	МассивЗн = Новый Массив;
	
	Если Метаданные.Документы.Найти(ВидОбъекта) <> Неопределено Тогда
		Для Каждого ТекСтр из Метаданные.Документы[ВидОбъекта].Реквизиты Цикл
			НовСтр = ТаблРеквизитов.Добавить();
			НовСтр.Наименование = ТекСтр.Имя;
		КонецЦикла;
	КонецЕсли;
	ТаблРеквизитов.Сортировать("Наименование Возр");
	Для Каждого ТекСтр из ТаблРеквизитов Цикл
		МассивЗн.Добавить(СокрЛП(ТекСтр.Наименование));
	КонецЦикла;
	
	Возврат МассивЗн;	
	
КонецФункции

&НаКлиенте
Процедура РеквизитНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СписокЗн = РеквизитНачалоВыбораНаСервере(Запись.ВидОбъекта);
	Элементы.РеквизитОбъекта.СписокВыбора.ЗагрузитьЗначения(СписокЗн);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитОбъектаОбработкаВыбораНаСервере(ВидОбъекта,ВыбранноеЗначение)
	
	Для Каждого ТекСтр из Метаданные.Документы[ВидОбъекта].Реквизиты[ВыбранноеЗначение].Тип.Типы() Цикл
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТекСтр);
		Возврат Новый ОписаниеТипов(МассивТипов);
		
	КонецЦикла;	
	
КонецФункции

&НаКлиенте
Процедура РеквизитОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Элементы.ЗначениеОбъекта.ОграничениеТипа = РеквизитОбъектаОбработкаВыбораНаСервере(Запись.ВидОбъекта, ВыбранноеЗначение);
	 
	Если Не ЗначениеЗаполнено(Запись.ЗначениеОбъекта) Тогда
		Запись.ЗначениеОбъекта = Элементы.ЗначениеОбъекта.ОграничениеТипа.ПривестиЗначение(Элементы.ЗначениеОбъекта);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитОбъектаОчисткаНаСервере()
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Неопределено);
	Возврат Новый ОписаниеТипов(МассивТипов);

КонецФункции

&НаКлиенте
Процедура РеквизитОбъектаОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ЗначениеОбъекта.ОграничениеТипа = РеквизитОбъектаОчисткаНаСервере();
	Запись.ЗначениеОбъекта = Элементы.ЗначениеОбъекта.ОграничениеТипа.ПривестиЗначение(Элементы.ЗначениеОбъекта);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидОбъектаОчисткаНаСервере()
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Неопределено);
	Возврат Новый ОписаниеТипов(МассивТипов);
	
КонецФункции

&НаКлиенте
Процедура ВидОбъектаОчистка(Элемент, СтандартнаяОбработка)
	
	Запись.РеквизитОбъекта = "";
	
	Элементы.ЗначениеОбъекта.ОграничениеТипа = ВидОбъектаОчисткаНаСервере();
	Запись.ЗначениеОбъекта = Элементы.ЗначениеОбъекта.ОграничениеТипа.ПривестиЗначение(Элементы.ЗначениеОбъекта);
	
КонецПроцедуры
